experiments/results/logs/ramp-hpa-010/wrk2.txt
Running 5m test @ http://localhost:30080/
  4 threads and 100 connections
  Thread calibration: mean lat.: 7500.117ms, rate sampling interval: 19644ms
  Thread calibration: mean lat.: 7450.624ms, rate sampling interval: 18841ms
  Thread calibration: mean lat.: 7824.573ms, rate sampling interval: 19611ms
  Thread calibration: mean lat.: 7215.018ms, rate sampling interval: 18661ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     2.22m     1.19m    4.29m    57.69%
    Req/Sec     3.05      0.22     4.00    100.00%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    2.22m 
 75.000%    3.25m 
 90.000%    3.87m 
 99.000%    4.22m 
 99.900%    4.27m 
 99.990%    4.29m 
 99.999%    4.29m 
100.000%    4.29m 

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

    9175.039     0.000000            1         1.00
   34865.151     0.100000          433         1.11
   59342.847     0.200000          865         1.25
   84213.759     0.300000         1298         1.43
  109314.047     0.400000         1732         1.67
  132972.543     0.500000         2165         2.00
  145752.063     0.550000         2377         2.22
  158466.047     0.600000         2595         2.50
  170393.599     0.650000         2809         2.86
  182452.223     0.700000         3026         3.33
  195297.279     0.750000         3241         4.00
  201981.951     0.775000         3353         4.44
  208273.407     0.800000         3464         5.00
  213254.143     0.825000         3566         5.71
  219807.743     0.850000         3673         6.67
  225968.127     0.875000         3781         8.00
  228458.495     0.887500         3835         8.89
  231997.439     0.900000         3891        10.00
  235274.239     0.912500         3943        11.43
  238157.823     0.925000         3997        13.33
  241827.839     0.937500         4052        16.00
  243269.631     0.943750         4079        17.78
  244711.423     0.950000         4106        20.00
  245891.071     0.956250         4134        22.86
  247070.719     0.962500         4164        26.67
  248250.367     0.968750         4188        32.00
  248905.727     0.971875         4200        35.56
  250085.375     0.975000         4213        40.00
  251265.023     0.978125         4227        45.71
  252051.455     0.981250         4240        53.33
  252444.671     0.984375         4254        64.00
  252706.815     0.985938         4261        71.11
  252968.959     0.987500         4269        80.00
  253362.175     0.989062         4276        91.43
  253624.319     0.990625         4281       106.67
  254017.535     0.992188         4289       128.00
  254148.607     0.992969         4293       142.22
  254279.679     0.993750         4296       160.00
  254410.751     0.994531         4300       182.86
  254541.823     0.995313         4302       213.33
  254803.967     0.996094         4306       256.00
  254803.967     0.996484         4306       284.44
  254935.039     0.996875         4309       320.00
  255197.183     0.997266         4310       365.71
  255328.255     0.997656         4311       426.67
  255459.327     0.998047         4313       512.00
  255590.399     0.998242         4315       568.89
  255590.399     0.998437         4315       640.00
  256245.759     0.998633         4317       731.43
  256245.759     0.998828         4317       853.33
  256245.759     0.999023         4317      1024.00
  256376.831     0.999121         4318      1137.78
  256376.831     0.999219         4318      1280.00
  256638.975     0.999316         4320      1462.86
  256638.975     0.999414         4320      1706.67
  256638.975     0.999512         4320      2048.00
  256638.975     0.999561         4320      2275.56
  256638.975     0.999609         4320      2560.00
  256638.975     0.999658         4320      2925.71
  256638.975     0.999707         4320      3413.33
  256638.975     0.999756         4320      4096.00
  257425.407     0.999780         4321      4551.11
  257425.407     1.000000         4321          inf
#[Mean    =   133411.459, StdDeviation   =    71140.871]
#[Max     =   257294.336, Total count    =         4321]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  4420 requests in 5.00m, 45.32MB read
  Socket errors: connect 0, read 0, write 0, timeout 10582
Requests/sec:     14.72
Transfer/sec:    154.60KB